7767517
77 97
Input                    in0                      0 1 in0
BinaryOp                 sub_0                    1 1 in0 1 0=1 1=1 2=-2.361164e+01
BinaryOp                 div_1                    1 1 1 2 0=3 1=1 2=8.254822e+02
Split                    splitncnn_0              1 3 2 3 4 5
Pooling1D                maxpool1d_39             1 1 5 6 0=0 1=3 2=1 3=1 5=1
Convolution1D            conv1d_11                1 1 6 7 0=32 1=1 2=1 3=1 4=0 5=0 6=32
Convolution1D            conv1d_7                 1 1 4 8 0=32 1=1 2=1 3=1 4=0 5=0 6=32
Split                    splitncnn_1              1 3 8 9 10 11
Convolution1D            conv1d_10                1 1 9 12 0=32 1=9 2=1 3=1 4=4 5=0 6=9216
Convolution1D            conv1d_9                 1 1 10 13 0=32 1=19 2=1 3=1 4=9 5=0 6=19456
Convolution1D            conv1d_8                 1 1 11 14 0=32 1=39 2=1 3=1 4=19 5=0 6=39936
Concat                   cat_0                    4 1 14 13 12 7 15 0=0
BatchNorm                bn_0                     1 1 15 16 0=128 1=1.000000e-05
ReLU                     relu_45                  1 1 16 17
Split                    splitncnn_2              1 2 17 18 19
Pooling1D                maxpool1d_40             1 1 19 20 0=0 1=3 2=1 3=1 5=1
Convolution1D            conv1d_16                1 1 20 21 0=32 1=1 2=1 3=1 4=0 5=0 6=4096
Convolution1D            conv1d_12                1 1 18 22 0=32 1=1 2=1 3=1 4=0 5=0 6=4096
Split                    splitncnn_3              1 3 22 23 24 25
Convolution1D            conv1d_15                1 1 23 26 0=32 1=9 2=1 3=1 4=4 5=0 6=9216
Convolution1D            conv1d_14                1 1 24 27 0=32 1=19 2=1 3=1 4=9 5=0 6=19456
Convolution1D            conv1d_13                1 1 25 28 0=32 1=39 2=1 3=1 4=19 5=0 6=39936
Concat                   cat_1                    4 1 28 27 26 21 29 0=0
BatchNorm                bn_1                     1 1 29 30 0=128 1=1.000000e-05
ReLU                     relu_46                  1 1 30 31
Split                    splitncnn_4              1 2 31 32 33
Pooling1D                maxpool1d_41             1 1 33 34 0=0 1=3 2=1 3=1 5=1
Convolution1D            conv1d_21                1 1 34 35 0=32 1=1 2=1 3=1 4=0 5=0 6=4096
Convolution1D            conv1d_17                1 1 32 36 0=32 1=1 2=1 3=1 4=0 5=0 6=4096
Split                    splitncnn_5              1 3 36 37 38 39
Convolution1D            conv1d_20                1 1 37 40 0=32 1=9 2=1 3=1 4=4 5=0 6=9216
Convolution1D            conv1d_19                1 1 38 41 0=32 1=19 2=1 3=1 4=9 5=0 6=19456
Convolution1D            conv1d_18                1 1 39 42 0=32 1=39 2=1 3=1 4=19 5=0 6=39936
Concat                   cat_2                    4 1 42 41 40 35 43 0=0
BatchNorm                bn_2                     1 1 43 44 0=128 1=1.000000e-05
Convolution1D            conv1d_22                1 1 3 45 0=128 1=1 2=1 3=1 4=0 5=1 6=128
BinaryOp                 add_2                    2 1 44 45 46 0=0
ReLU                     relu_47                  1 1 46 47
Split                    splitncnn_6              1 3 47 48 49 50
Pooling1D                maxpool1d_42             1 1 50 51 0=0 1=3 2=1 3=1 5=1
Convolution1D            conv1d_27                1 1 51 52 0=32 1=1 2=1 3=1 4=0 5=0 6=4096
Convolution1D            conv1d_23                1 1 49 53 0=32 1=1 2=1 3=1 4=0 5=0 6=4096
Split                    splitncnn_7              1 3 53 54 55 56
Convolution1D            conv1d_26                1 1 54 57 0=32 1=9 2=1 3=1 4=4 5=0 6=9216
Convolution1D            conv1d_25                1 1 55 58 0=32 1=19 2=1 3=1 4=9 5=0 6=19456
Convolution1D            conv1d_24                1 1 56 59 0=32 1=39 2=1 3=1 4=19 5=0 6=39936
Concat                   cat_3                    4 1 59 58 57 52 60 0=0
BatchNorm                bn_3                     1 1 60 61 0=128 1=1.000000e-05
ReLU                     relu_48                  1 1 61 62
Split                    splitncnn_8              1 2 62 63 64
Pooling1D                maxpool1d_43             1 1 64 65 0=0 1=3 2=1 3=1 5=1
Convolution1D            conv1d_32                1 1 65 66 0=32 1=1 2=1 3=1 4=0 5=0 6=4096
Convolution1D            conv1d_28                1 1 63 67 0=32 1=1 2=1 3=1 4=0 5=0 6=4096
Split                    splitncnn_9              1 3 67 68 69 70
Convolution1D            conv1d_31                1 1 68 71 0=32 1=9 2=1 3=1 4=4 5=0 6=9216
Convolution1D            conv1d_30                1 1 69 72 0=32 1=19 2=1 3=1 4=9 5=0 6=19456
Convolution1D            conv1d_29                1 1 70 73 0=32 1=39 2=1 3=1 4=19 5=0 6=39936
Concat                   cat_4                    4 1 73 72 71 66 74 0=0
BatchNorm                bn_4                     1 1 74 75 0=128 1=1.000000e-05
ReLU                     relu_49                  1 1 75 76
Split                    splitncnn_10             1 2 76 77 78
Pooling1D                maxpool1d_44             1 1 78 79 0=0 1=3 2=1 3=1 5=1
Convolution1D            conv1d_37                1 1 79 80 0=32 1=1 2=1 3=1 4=0 5=0 6=4096
Convolution1D            conv1d_33                1 1 77 81 0=32 1=1 2=1 3=1 4=0 5=0 6=4096
Split                    splitncnn_11             1 3 81 82 83 84
Convolution1D            conv1d_36                1 1 82 85 0=32 1=9 2=1 3=1 4=4 5=0 6=9216
Convolution1D            conv1d_35                1 1 83 86 0=32 1=19 2=1 3=1 4=9 5=0 6=19456
Convolution1D            conv1d_34                1 1 84 87 0=32 1=39 2=1 3=1 4=19 5=0 6=39936
Concat                   cat_5                    4 1 87 86 85 80 88 0=0
BatchNorm                bn_6                     1 1 48 89 0=128 1=1.000000e-05
BatchNorm                bn_5                     1 1 88 90 0=128 1=1.000000e-05
BinaryOp                 add_3                    2 1 90 89 91 0=0
ReLU                     relu_50                  1 1 91 92
Pooling1D                aap_54                   1 1 92 93 0=1 7=1 8=1
Reshape                  reshape_52               1 1 93 94 0=128
InnerProduct             linear_38                1 1 94 95 0=3 1=1 2=384
Softmax                  softmax_51               1 1 95 out0 0=0 1=1
